const DATABASE = [
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Ukraine.jpg",
    title: "Різдво в Україні",
    alt: "Ukraine",
    description:
      "Весь православний світ 7 січня відзначає Різдво – свято, яке здавна вважається одним з найважливіших і найкрасивіших у християнстві. Цього дня у Вифлеємі народився Ісус Христос, який був посланий Богом на землю для спокутування гріхів і спасіння людства ('Ісус' у перекладі з єврейського означає 'порятунок'). В українській культурі Різдво починають святкувати шостого січня, в Святвечір (Святий вечір). У цей день також слід дотримуватися суворого посту з повним утриманням від їжі до першої зірки. Вечірня трапеза ставала закінченням суворого передріздвяного сорокаденного посту. За столом прийнято збиратися всією сім'єю відразу ж після появи першої зірки в небі, яка символізує Віфлеємську зірку, що оповістила пастухів про народження Ісуса. Починаючи з вечора 6 січня, було прийнято колядувати. Колядники ходили по дворах з 'Віфлеємською зіркою' – великою зіркою із позолоченого паперу, прикрашеною ліхтариком, паперовими гірляндами, іноді іконою, яка закріплювалася на палиці. Колядники наспівували різдвяні гімни – колядки та щедрівки. За свої піснеспіви колядники просили у господарів навколишніх будинків монети. Ця традиція збереглася досі. Один із стародавніх різдвяних звичаїв в Україні – вертеп. Це мініатюрний ляльковий театр, розміщений в коробці, в якому програвали цілі вистави на тему Різдва. Ляльок виготовляли з паперу, вати, воску, наряджали в парчеві і шовкові каптани. У центр композиції незмінно поміщали Марію з Йосипом, схилених над яслами з Божественним Немовлям. У західних і південних областях України такий вертеп часто встановлювали в церкві. У XIX столітті в багатьох міських будинках увійшло в моду робити для дітей маленький домашній вертеп, його ставили під ялинку.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Sweden.jpg",
    title: "Різдво у Швеції",
    alt: "Sweden",
    description:
      "Підготовку до Різдва розпочинають за місяць: запалюють першу з чотирьох свічок у спеціальному підсвічнику або вінку, причому згоріти їй дають лише на чверть. За тиждень запалюють дві свічки – ту, що на чверть згоріла, й нову. Так роблять аж до Різдва, коли на святковому столі запалюють останню свічку. Поруч уже стоять традиційні страви: різдвяний окорок, свиняча ковбаса, маринований оселедець, «губброра» – суміш з яєць й анчоусів, картопля, житній хліб із пивним суслом, і «лютефіск» – страва з вимоченої риби. Запивають усе це глінтвейном, грогом або його шведським різновидом – «глеггом». Увечері один із членів сім’ї знаходить привід відлучитися з хати, і ось у двері стукає дідо Юльтомтен із мішком подарунків. У місті Евле під час адвенту встановлюють величезну солом’яну фігуру Різдвяного козла, але до Різдва він зазвичай не доживає – попри всі заходи безпеки його підпалюють місцеві веселуни, перетворивши цю витівку на своєрідний спорт. ",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Norway.jpg",
    title: "Різдво у Норвегії",
    alt: "Norway",
    description:
      "У Норвегії Різдво називають Юль, тому норвезького Санта-Клауса звуть Юленіссе. Різдвяні традиції норвежців кореняться у дохристиянській добі. Тоді святкування полягало в принесенні в жертву тварин і розпиванні великої кількості пива. Нині обмежуються пивом у супроводі хрустких свинячих і баранячих реберець та тріски. Натомість збереглася інша різдвяна традиція: ховати у Святвечір усі мітли та віники – щоб залишити без транспортних засобів відьом й іншу нечисть. Як і в інших північних країнах Європи під час Різдва, в Норвегії всі міста й села прикрашені гірляндами, у вікнах будинків сяють ліхтарики. В такому освітленні казково виглядає місто Рьорус із дерев’яною забудовою – пам’ятка ЮНЕСКО. У місті Дрьобак є поштове відділення Санта-Клауса і єдиний на всю Скандинавію різдвяний магазин, відкритий цілий рік. А мешканці Бергена започаткували власну різдвяну традицію: місцеві підприємства, школи, дитсадки й небайдужі городяни об’єднують зусилля і споруджують ціле місто з імбирного печива.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Finland.jpg",
    title: "Різдво у Фінляндії",
    alt: "Finland",
    description:
      "Важливим елементом Різдва для фінів є… сауна. Вони вірять, що саме там живе різдвяний ельф — захисник сім’ї, а відтак освітлюють сауну й кілька годин паряться у ній на Святвечір. У цей день заведено також відвідувати могили близьких, класти на них вінки та ялинові гілки й запалювати свічки – і коли темнішає, на засніженому кладовищі мерехтять тисячі вогників. Різдвяного ранку всі йдуть на службу до церкви, а потім настає найважливіший момент для дітей. Кожного малюка має особисто навідати й обдарувати дідо Йоулупуккі, в якого перебирається батько чи сусід. Фіни впевнені, що Йоулупуккі разом із дружиною та купою гномів живе саме у Фінляндії, а не деінде на Півночі. Його ім’я у перекладі означає «різдвяний козел», адже їздить він на санях, запряжених козликом.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Czech.jpg",
    title: "Різдво у Чехії",
    alt: "Czech",
    description:
      "5 грудня подарунки чеським дітям розносить святий Мікулаш, але ходить він не сам, як наш Миколай, а в супроводі янгола й чорта, або навіть кількох янголів і чортів. Подарунки він несе у кошику. Чорти погрожують дітям – мовляв, неслухняних заберуть із собою до пекла. Проте янголи їх стримують, аж поки Мікулаш почує від батьків, що дітлахи таки були чемними цілий рік, і кожному з них дасть подарунок. А ось на Святвечір 24 грудня дарунки отримують усі – і діти, і дорослі. Доставляє їх, як не дивно, Єжишек, тобто Ісусик. Як це робить немовля – невідомо, адже його ніхто ніколи не бачить: варто на секунду вийти з дітьми з кімнати – і подарунки опиняються під різдвяною ялинкою. Єжишек має власне поштове відділення в містечку Божі-Дар, що у горах на кордоні з Німеччиною. Щороку до нього прибуває кількадесят тисяч листів, аби отримати Єжишкову печатку й вирушити далі, до адресатів по цілій країні та за кордон.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Austria.jpg",
    title: "Різдво в Австрії",
    alt: "Austria",
    description:
      "В Австрії різдвяні ярмарки не так піддалися комерціалізації, як в інших країнах, і більше наслідують різдвяні традиції. У Відні ярмарки працюють одразу в кількох районах міста з ранку і до пізньої ночі. Продаються там сувеніри та подарунки ручної роботи й традиційні смаколики, наприклад, штоллен – різдвяний кекс. Солодощами – шоколадками, марципанами, білочками та голубами з тіста – заведено прикрашати ялинки. Використовують і звичайні прикраси, здебільшого червоні й золоті, і обов’язково – справжні свічки, які запалюють за спеціальним ритуалом. Подарунки потрапляють під ялинку так само, як і у Чехії, – їх розносить Christkind, Христос-дитятко, за списком, який діти написали напередодні й залишили на підвіконні. Щоб дітлахам легше було дочекатися Різдва, батьки купують для них адвент-календарі у вигляді будиночків чи паровозиків з 24-ма віконцями: щодня треба відкривати одне віконце, за яким у комірці лежить цукерка або маленька іграшка.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Germany.jpg",
    title: "Різдво у Німеччині",
    alt: "Germany",
    description:
      "У Німеччині теж популярні адвент-календарі й традиція запалювати чотири свічки у різдвяному вінку впродовж адвенту. А ось у справі декорування осель німці перевершили всіх. Їхні будинки і подвір’я перетворюються на справжні виставки різдвяного декору й ілюмінації. На дверях вішають вінок, вікна оздоблюють фігурками та підвісками, скло розмальовують, на підвіконні запалюють різдвяну свічку – неодмінно «живу», не електричну. Надворі ставлять традиційну шопку, фігури оленів і зайців.  Саме у Німеччині народилася традиція прикрашати ялинку на Різдво. У добу середньовіччя під дверима церков розігрували вистави на тему вигнання з раю, і роль вічнозеленого дерева виконувала ялинка, до гілок якої прив’язували червоні яблука. З часом ці вистави перекочували в оселі, згодом зникли – а ось ялинка лишилася. Німці прикрашають її пряниками й печивом у вигляді вершників, пташок, зірок, мережив. Під ялинкою залишає подарунки німецький Миколай – дідо Вайхнахтсман. Німецькі різдвяні ярмарки – найяскравіші у цілій Європі. В одному лише Мюнхені під час адвенту діє зо три десятки ярмарків, кожен з яких має власну атмосферу, а якщо порахувати й околиці, то ярмарків набереться не менше сотні! Щороку різдвяні ярмарки приваблюють у Німеччину сотні тисяч туристів – і з сусідніх країн, і здалеку.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Poland.jpg",
    title: "Різдво у Польщі",
    alt: "Poland",
    description:
      "Якщо в інших країнах релігійна складова Різдва відійшла на задній план, у Польщі зберегли дух цього свята всепрощення і добра. Під час адвенту в кожному костелі встановлюють шопки, по-святковому оздоблюють храм, проводять передріздвяні меси. Головне богослужіння відбувається 24 грудня. Саме у Польщі в іноземця є шанс потрапити на Вігілію – урочисту родинну вечерю на Святвечір: поляки слідкують, щоб у такий день ніхто з родичів, друзів і навіть випадкових знайомих не лишився сам. Перед тим як із появою першої зірки сісти за стіл, господар дому роздає усім облатки. Кожен має підійти по черзі до всіх присутніх, дозволити відламати шматочок своєї облатки і навпаки, відламати кусничок в іншого. При цьому треба сказати кілька добрих слів, обійняти людину та побажати їй щасливого Різдва. Ця традиція походить від переломлення хліба під час Тайної Вечері. Після завершення ритуалу можна доїсти свою облатку й сідати за стіл. Як і у нас, на Святвечір подають 12 пісних страв, серед яких обов’язково є борщ з вушками або грибна зупа, карп, оселедець, вареники, бігос або голубці, кутя, маковий рулет й імбирний пряник.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Belgium.jpg",
    title: "Різдво у Бельгії",
    alt: "Belgium",
    description:
      "Під час адвенту бельгійці виставляють у своїх оселях фігурки Діви Марії, Йосифа, немовляти Ісуса та волхвів. Нерідко ці фігурки старовинні й передаються із покоління у покоління. У багатьох регіонах Бельгії розігрують різдвяні вистави, а позаяк ця традиція походить з XVI століття, то і їхні учасники вбрані в костюми тієї доби. У провінції Намюр є власна традиція святкування Різдва: святкову ніч люди проводять… за грою в карти. Грають у кожній кнайпі та кав’ярні. Той, хто виграє, отримує керстброден — вкриту глазур’ю здобну булку у формі ангелика чи Ісусика, або чимале шоколадне поліно. Донедавна зберігалася традиція трубити в різдвяний ріг. Цей інструмент завдовжки метр-півтора виготовлявся з вигнутого і видовбаного зсередини шматка вільхи або з металу. У ріг трубили над колодязем, щоб посилити звук, і робили це щодня від Святвечора аж до Хрещення, аби відігнати «дике полювання» – цілий сонм злих духів, який проноситься цими днями в повітрі. З тією ж метою обходили будинки зі смолоскипами та свічками, окурювали житло димом ялівця і дзвонили в дзвони.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/France.jpg",
    title: "Різдво у Франції",
    alt: "France",
    description:
      "У Франції різдвяні традиції менш чи більш осучаснилися. Найбільше уваги тут приділяється купівлі подарунків й оздобленню осель і вулиць ілюмінацією. Ялинки зазвичай прикрашають білими свічками та червоними стрічками, але слід пам’ятати, що саме Франція є батьківщиною ялинкових прикрас. Первісно ялинки прикрашали яблуками, аж поки у неврожайний 1858 рік склодуви Лотарінгії не додумалися замінити їх скляними кульками. До святкової вечері, що називається «ревейон», подають м’ясо, устриці, запеченого індика, паштет із гусячої печінки, вино і, звичайно, шампанське, а на десерт – торт у формі поліна. Він символізує справжнє поліно, яке колись обносили навколо столу, промовляючи спеціальні слова, а згодом спалювали у печі. Тріски від нього ретельно збирали – вони мали упродовж року оберігати дім від пожеж та витівок диявола.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Spain.jpg",
    title: "Різдво в Іспанії",
    alt: "Spain",
    description:
      "В Іспанії Різдво святкують шумно і весело. Під час адвенту звідусіль чути музику й апетитні запахи вуличної їжі – це працюють різдвяні ярмарки, відбуваються концерти та забави. Справжній ажіотаж викликають різдвяні лотереї – і державні, де можна зірвати крупний джек-пот, і численні дрібні лотереї від крамниць і ресторанів. 24 грудня вдень іспанці прогулюються вулицями, зустрічають знайомих, випивають з ними по келиху вина в барі та йдуть гуляти далі. Центральні вулиці Мадрида, Барселони, Севільї, Сарагоси й Валенсії наповнюються людьми у національних костюмах, які танцюють і співають. Так само люди танцюють, узявшись за руки, біля входу в собор перед початком урочистої різдвяної меси. З церкви йдуть додому чи в ресторан – на Святвечір у колі сім’ї. Застілля переходить у спів різдвяних пісень вільянсико.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/England.jpg",
    title: "Різдво в Англії",
    alt: "England",
    description:
      "В Англії Різдво – справжнє сімейне свято. Цього дня всі збираються в батьківському домі, дарують один одному подарунки і переглядають сімейні фотографії. Традиційною стравою є індичка під соусом з аґрусу і пудинг. А п’ють в цей день виключно чай або бренді. Окрасою англійського різдвяного столу є святковий пиріг. За старовинним звичаєм, його начиняють різними предметами, що пророкують долю на найближчий рік тому, в чиєму шматку виявиться цей предмет. Англійці вірять, що каблучка означає швидке весілля, копійка – багатство в майбутньому, а підкова – успіх в новому році.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/Japan.jpg",
    title: "Різдво в Японії",
    alt: "Japan",
    description:
      "В Японії замість Діда Мороза основна фігура свята – бог Хотейошо, у якого очі… на потилиці. Традиційне різдвяне меню японців – рис, боби, гриби і бамбук. І, звичайно, улюблений веселий напій саке. Ще на Різдво японці біля своїх будинків розвішують на високих жердинах пучки соломи і підпалюють їх, щоб відлякати злих духів.",
  },
  {
    image:
      "https://raw.githubusercontent.com/phpslonuk/JS_DOM/main/img/USA.jpg",
    title: "Різдво в США",
    alt: "USA",
    description:
      "Сполучені штати – багатонаціональна країна, тому можна побачити різні способи святкування Різдва. Деякі готують традиційну фаршировану індичку. Інші вважають, що куди  краще ковбаски, страви з капусти та супи. Італійці готують на Різдво лазанью. Діти отримують подарунки вранці. Їм кажуть, що вночі приходив Санта-Клаус, він спустився димоходом і приніс подарунки. У різдвяний ранок традиційно подають рулет з корицею і каву, а на обід – шинку. Американці – нація, яка чи не найбільше отримує і дарує подарунків у це свято. У невеликих містах Америки прийнято ходити один до одного в гості та всім разом співати різдвяні пісні. У США будь-які заклади,  чи то банк, магазин чи фірма, зачиняються. Всі відпочивають і найчастіше дивляться по телевізору «Лускунчика» і «Червону шапочку».",
  },
];

const changeContent = (e) => {
  let index = +e.target.dataset.index;
  document.querySelector(".article").innerHTML = createContent(index);
};

const createContent = (index = 0) => {
  let content = `
      <div>
        <h2 class="title">${DATABASE[index].title}</h2>
      </div>
      <p class="country-description">${DATABASE[index].description}</p>
      <img class="country-img" src="${DATABASE[index].image}">`;
  return content;
};

const createMenu = () => {
  let navList = document.createElement("ul");
  navList.className = "main-menu";
  navList.addEventListener("click", changeContent);
  DATABASE.forEach((item, i) => {
    let li = document.createElement("li");
    li.className = "nav-list";
    li.setAttribute("data-index", i);
    let text = document.createTextNode(item.alt);
    li.appendChild(text);
    navList.appendChild(li);
  });
  return navList;
};

const renderContent = () => {
  let content = document.querySelector(".main");
  let article = document.createElement("article");
  let navigation = document.createElement("nav");
  navigation.className = "navbar";
  article.className = "article";
  article.innerHTML = createContent();
  navigation.appendChild(createMenu());
  content.appendChild(navigation);
  content.appendChild(article);
};

renderContent();
